src/toir_cf/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.торо_ДокументыПлановыхДатРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаНачалаЦепочки</name>
    <type>
      <types>EnumRef.торо_ВидыДокументовНачалаЦепочкиРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачалаЦепочки</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <registerRecords>AccumulationRegister.торо_ВыполняемыеРемонтныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.торо_ВсеДокументыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыРемонтов</registerRecords>
  <registerRecords>InformationRegister.торо_ГарантийностьРемонтов</registerRecords>
  <registerRecords>AccumulationRegister.торо_ЗапланированныеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_НарядыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорБригада</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>Предписание</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_ПараллельнойОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеПредписания</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзДокументаОснования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВнешнегоОснования</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПодрядчики</name>
    <comment>Заменена на ТЧ ИсполнителиПоРемонтам</comment>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>EnumRef.торо_ОтветственныеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнителиПоРемонтам</name>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеИсполнителя</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/CommonForms/торо_ФормаОперацийБезНарядов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем СозданыАкты;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокОснование") Тогда
		ДокОснование = Параметры.ДокОснование;
	КонецЕсли;
	
	Если Параметры.Свойство("ТабОперацийБезНаряда") Тогда
		
		ТабОперацийБезНаряда = Параметры.ТабОперацийБезНаряда.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таб.ВводитьНаряд КАК ВводитьНаряд,
		               |	Таб.ОбъектРемонта КАК ОбъектРемонта,
		               |	Таб.ВидРемонта КАК ВидРемонта,
		               |	Таб.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	Таб.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	Таб.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	Таб.ID КАК ID,
		               |	Таб.ID_Операции КАК ID_Операции
		               |ПОМЕСТИТЬ ТабОперацийБезНаряда
		               |ИЗ
		               |	&ТабОперацийБезНаряда КАК Таб
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабОперацийБезНаряда.ВводитьНаряд КАК ВводитьНаряд,
		               |	ТабОперацийБезНаряда.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТабОперацийБезНаряда.ВидРемонта КАК ВидРемонта,
		               |	ТабОперацийБезНаряда.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	ВЫБОР
		               |		КОГДА ТабОперацийБезНаряда.ДатаНачалаРемонта = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала
		               |		ИНАЧЕ ТабОперацийБезНаряда.ДатаНачалаРемонта
		               |	КОНЕЦ КАК ДатаНачалаРемонта,
		               |	ВЫБОР
		               |		КОГДА ТабОперацийБезНаряда.ДатаОкончанияРемонта = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания
		               |		ИНАЧЕ ТабОперацийБезНаряда.ДатаОкончанияРемонта
		               |	КОНЕЦ КАК ДатаОкончанияРемонта,
		               |	ТабОперацийБезНаряда.ID КАК ID,
		               |	ТабОперацийБезНаряда.ID_Операции КАК ID_Операции
		               |ИЗ
		               |	ТабОперацийБезНаряда КАК ТабОперацийБезНаряда
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		               |		ПО ТабОперацийБезНаряда.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
		               |ИТОГИ ПО
		               |	ОбъектРемонта,
		               |	ДатаНачалаРемонта,
		               |	ВидРемонта";
		
		Запрос.УстановитьПараметр("ТабОперацийБезНаряда", ТабОперацийБезНаряда);
		Результат = Запрос.Выполнить();
		ВыборкаОбъектРемонта = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Дерево = РеквизитФормыВЗначение("РемонтныеРаботы");
		
		Пока ВыборкаОбъектРемонта.Следующий() Цикл
			
			НоваяСтрока = Дерево.Строки.Добавить();
			НоваяСтрока.Объект = ВыборкаОбъектРемонта.ОбъектРемонта;
			
			ВыборкаДатаНачала = ВыборкаОбъектРемонта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДатаНачала.Следующий() Цикл
								
				ВыборкаВидРемонта = ВыборкаДатаНачала.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаВидРемонта.Следующий() Цикл
					НС = НоваяСтрока.Строки.Добавить();
					НС.Объект = ВыборкаВидРемонта.ВидРемонта;
					
					ВыборкаДетЗаписи = ВыборкаВидРемонта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаДетЗаписи.Следующий() Цикл
						
						НС.ДатаНачала = ВыборкаДетЗаписи.ДатаНачалаРемонта;
						НС.ДатаОкончания = ВыборкаДетЗаписи.ДатаОкончанияРемонта;
						
						НовСтр = НС.Строки.Добавить();
						НовСтр.Объект = ВыборкаДетЗаписи.РемонтнаяРабота;	
						НовСтр.ID = ВыборкаДетЗаписи.ID;
						НовСтр.ID_Операции = ВыборкаДетЗаписи.ID_Операции;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(Дерево, "РемонтныеРаботы");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Развернуть(Команды.Развернуть);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не СозданыАкты Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно создать ""Акт о выполнении этапа работ"" поскольку документ-основание содержит ремонты с работами повышенной опасности. Требуется обязательно ввести документ ""Наряд на выполнение ремонтных работ""!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонтныеРаботы

&НаКлиенте
Процедура РемонтныеРаботыВыбранПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РемонтныеРаботы.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		ПроставитьГалочкиПоВеткеВниз (ТекСтрока, ТекСтрока.Выбран);
		ПроставитьГалочкиПоВеткеВверх(ТекСтрока.ПолучитьРодителя(), ТекСтрока.Выбран);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВвестиНаряды(Команда)
	ВвестиНарядыНаСервере();
		
	СтруктураПараметров = Новый Структура;
	Основание = Новый Структура;
	Основание.Вставить("Основание", ДокОснование);
	Основание.Вставить("ОпасныеРаботы", Истина);
	Основание.Вставить("ИзНормативов", ИзНормативов);
	Основание.Вставить("ВыбранныеОперации", ВыбранныеОперации);
	СтруктураПараметров.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ФормаОбъекта", СтруктураПараметров);
	
	СозданыАкты = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	
	Для каждого Стр Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		
		Стр.Выбран = Ложь;
		ПроставитьГалочкиПоВеткеВниз (Стр, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для каждого Стр Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		
		Стр.Выбран = Истина;
		ПроставитьГалочкиПоВеткеВниз (Стр, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)	
	Для Каждого ТекСтрока Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		Элементы.РемонтныеРаботы.Развернуть(ТекСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	Для каждого Стр Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		
		СвернутьПодчиненные(Стр);
		Элементы.РемонтныеРаботы.Свернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВвестиНарядыНаСервере()
	Дерево = РеквизитФормыВЗначение("РемонтныеРаботы");
	Рез = Дерево.Строки.Найти(Истина, "Выбран", Истина); 
	
	Если Рез = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран ни один ремонт!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Для каждого СтрокаОР Из Дерево.Строки Цикл
		Если Не СтрокаОР.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаВР Из СтрокаОР.Строки Цикл
			Если Не СтрокаВР.Выбран Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаОперации Из СтрокаВР.Строки Цикл
				Если Не СтрокаОперации.Выбран Тогда
					Продолжить;
				КонецЕсли;
				
				НС = ВыбранныеОперации.Добавить();
				НС.ДатаНачалаРемонта = СтрокаВР.ДатаНачала;
				НС.ДатаОкончанияРемонта = СтрокаВР.ДатаОкончания; 
				НС.ВидРемонта = СтрокаВР.Объект;
				НС.ID = СтрокаОперации.ID;
				НС.ID_Операции = СтрокаОперации.ID_Операции;
				НС.РемонтнаяРабота = СтрокаОперации.Объект;
				НС.ОбъектРемонта = СтрокаОР.Объект;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ВыбранныеОперации.Количество() 
		И (ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") 
		Или ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт")) Тогда
		ИзНормативов = Ложь;
	ИначеЕсли ВыбранныеОперации.Количество() 
		И (ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта")
		Или ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты")) Тогда
		ИзНормативов = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьГалочкиПоВеткеВниз(СтрокаДерева, ЗначГалки)
	
	Для Каждого Элем Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Элем.Выбран = ЗначГалки;
		ПроставитьГалочкиПоВеткеВниз(Элем, ЗначГалки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьГалочкиПоВеткеВверх(СтрокаДерева, ЗначГалки)
	Если СтрокаДерева = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначГалки Или Не ЕстьПодчиненныеСУстановленнымФлагом(СтрокаДерева) Тогда
		СтрокаДерева.Выбран = ЗначГалки;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПроставитьГалочкиПоВеткеВверх(СтрокаДерева.ПолучитьРодителя(), ЗначГалки);
КонецПроцедуры

&НаКлиенте
Функция ЕстьПодчиненныеСУстановленнымФлагом(СтрокаДерева)
	Для каждого ТекущаяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
	    Если ТекущаяСтрока.Выбран Тогда
		    Возврат Истина;
		КонецЕсли;
		
		Если ЕстьПодчиненныеСУстановленнымФлагом(ТекущаяСтрока) Тогда
		    Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура СвернутьПодчиненные(Строка)
	
	Для каждого Стр Из Строка.ПолучитьЭлементы() Цикл
		
		СвернутьПодчиненные(Стр);
		Элементы.РемонтныеРаботы.Свернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла; 	
	
КонецПроцедуры

#Если Клиент Тогда
	СозданыАкты = Ложь;
#КонецЕсли

#КонецОбласти
